birthdays = {
    'Лев Яшин': '22.10.1929',
    'Алла Пугачева': '15.04.1949',
    'Филипп Киркоров': '30.04.1967',
    'Максим Галкин': '18.06.1976',
    'Федор Емельяненко': '28.09.1976',
    'Хабиб Нурмагомедов': '20.09.1988',
    'Лев Толстой': '9.09.1828',
    'Федор Достоевский': '11.11.1821',
    'Владимир Путин': '7.10.1952',
    'Владимир Жириновский': '25.04.1946'
}
list_birthdays = ['Лев Яшин', 'Алла Пугачева', 'Филипп Киркоров', 'Максим Галкин', 'Федор Емельяненко', 'Хабиб Нурмагомедов', 'Лев Толстой', 'Федор Достоевский', 'Владимир Путин', 'Владимир Жириновский']

import random
random_birthdays = random.sample(list_birthdays, 4)

list_answer_birthday = []
for i in random_birthdays:
    answer = input(f'Введите дату, когда родился {i} в формате dd.mm.yyyy: ')
    birthday = int(answer in birthdays.values())
    list_answer_birthday.append(birthday)
    if birthday == 1:
        print('Верно.')
    else:
        print('Неправильно')

a = (list_answer_birthday.count(1))
print(f'Количество правильных ответов: {a}')

restart = input('Пройти тест заново да/нет: ')


